---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalBeamRigidLink
source: html/b6ecb9ef-bb05-9232-4467-4e3e9fa6223b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalBeamRigidLink Property

"Analytical Links"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAnalyticalBeamRigidLink { get; }
```